---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.AirFanType
source: html/11ab7406-948d-6685-1523-549e4cbef3ff.htm
---
# Autodesk.Revit.DB.Mechanical.AirFanType

The type of air fan.

## Syntax (C#)
```csharp
public enum AirFanType
```